<?php 

function count_of_pairs($arr, $n) 
{ 
 $count = 0; 
    for ($i = 0; $i < $n - 1; $i++) 
    { 
        if ($arr[$i] == $arr[$i + 1]) 
            $count++; 
    } 
    return $count; 
} 

$arr = array(1,1,2,3,4,-51,12,12,12,-51,24,12,33,33,10,1,0,0,13,78,56,22,22,78,79,45,16,17,54,55,56,10,11,1,2,3,4,5,7,8,99,9,99,10,-75,-75,30,33,89,72,14,37,54,55,54,54,-80,-81,40,42,44,43,99,99,85,-85); 
$n = sizeof($arr); 
echo 'Количество последовательных пар одинаковых элементов в заданном массиве: '.count_of_pairs($arr, $n); 

?> 